<template>
    <div class="common-cover">
        <comHeader />
        <div class="common-scroll better-scroll p-t-10">
            <div class="w-1100 common-bg-1 p-20">
                <h2>简历模块</h2>
                <h3>个人说明</h3>
                <p>
                    90后草根站长,
                    大学主修电子专业，接触了基本的计算机技术，在日常学习和工作中，我养成了善于总结和做笔记的好习惯。每当遇到新的知识或技术难点，我都会详细记录，深入思考，并整理成笔记。这种习惯不仅帮助我巩固了所学内容，还使我在面对类似问题时能够迅速找到解决方案。善于总结和做笔记，让我在技术领域不断进步，也提升了我的问题解决能力。
                </p>
                <p>
                    自2019年起，我正式步入了前端开发的大门。那时的我，怀揣着对技术的渴望和对创新的追求，开始了这场精彩的技术之旅。
                    前端开发，这个看似简单却深藏玄机的领域，让我感受到了编程的无穷魅力。而JavaScript，作为前端开发的核心语言，更是让我深陷其中，无法自拔。
                    我深入钻研JavaScript，从基础语法到高级特性，从DOM操作到事件处理，每一个细节都不放过。在不断地实践和探索中，我逐渐掌握了这门语言的精髓，能够灵活地运用它来实现各种复杂的功能和交互效果。
                    随着对JavaScript的深入理解，我开始接触并学习了Vue.js框架。Vue.js的简洁、直观和高效让我眼前一亮。通过Vue.js，我能够轻松地构建出响应式、可维护的用户界面，大大提高了开发效率。同时，Vue的组件化开发方式也让我受益匪浅，它使我能够将复杂的页面拆分成多个独立的组件，每个组件负责自己的功能和渲染，这让代码更加清晰、易于维护。
                    在掌握Vue.js的基础上，我进一步拓展了uniapp、Electron、Node.js和Webpack等技术。uniapp让我能够实现一次编写、多端运行，这大大提高了跨平台开发的效率，让应用能够轻松地覆盖多个平台。Electron则允许我使用Web技术构建桌面应用，这为我打开了新的开发领域，让我能够为用户提供更加丰富的功能和更好的交互体验。
                    而Node.js的出现，更是让我看到了前后端技术融合的可能性。通过Node.js，可以在服务器端运行JavaScript代码，实现前后端技术的统一。这不仅提高了开发效率，还让我能够更好地理解整个应用的运行流程。
                    Webpack作为前端工程的利器，也是我必须掌握的技术之一。通过Webpack，我可以对项目的结构和代码进行优化，提高代码的运行效率。同时，Webpack的灵活配置也让我能够根据不同的项目需求进行定制化开发。
                    回顾这几年的前端学习之路，我深感收获颇丰。从最初的JavaScript入门到现在的精通多项前端技术栈，我经历了无数的挑战和磨砺。但正是这些经历让我更加坚定了对前端的热爱和追求。未来，我将继续保持学习的热情和进取的心态，紧跟前端技术的最新发展动态，不断提升自己的技术水平。同时，我也期待能够将我的经验和知识分享给更多的人，共同推动前端领域的发展与进步。
                </p>
                <h3>与我联系</h3>
                <p>您可以通过线上QQ或者以下方式与我取得联系，非常期待和您成为朋友</p>
                <p>电话： 17726331938 (微信同号)</p>
                <p>邮件： 1925541533@qq.com</p>
                <p>网址： <a href="http://139.9.210.43/">http://139.9.210.43/</a></p>
                <p>Q Q： 1925541533</p>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    components: {},
    data() {
        return {}
    },
    methods: {},
}
</script>

<style lang="scss" scoped>
.p-20 {
    padding: 20px;
}
h2,
h3,
p {
    color: #444;
}
h3 {
    margin: 12px 0;
}
p {
    line-height: 27px;
    text-indent: 32px;
}
</style>
